### ⚠️ Terraform Plan: Changes detected

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudflare.data.cloudflare_zone.main will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudflare_zone" "main" {
      + account               = (known after apply)
      + activated_on          = (known after apply)
      + cname_suffix          = (known after apply)
      + created_on            = (known after apply)
      + development_mode      = (known after apply)
      + filter                = {
          + match = (known after apply)
          + name  = "hekuta.net"
        }
      + id                    = (known after apply)
      + meta                  = (known after apply)
      + modified_on           = (known after apply)
      + name                  = (known after apply)
      + name_servers          = (known after apply)
      + original_dnshost      = (known after apply)
      + original_name_servers = (known after apply)
      + original_registrar    = (known after apply)
      + owner                 = (known after apply)
      + paused                = (known after apply)
      + permissions           = (known after apply)
      + plan                  = (known after apply)
      + status                = (known after apply)
      + tenant                = (known after apply)
      + tenant_unit           = (known after apply)
      + type                  = (known after apply)
      + vanity_name_servers   = (known after apply)
      + verification_key      = (known after apply)
      + zone_id               = (known after apply)
    }

  # module.cloudflare.cloudflare_dns_record.api will be created
  + resource "cloudflare_dns_record" "api" {
      + comment             = "App Engine カスタムドメイン用 CNAME"
      + comment_modified_on = (known after apply)
      + content             = "ghs.googlehosted.com"
      + created_on          = (known after apply)
      + id                  = (known after apply)
      + meta                = (known after apply)
      + modified_on         = (known after apply)
      + name                = "tut-bus-api"
      + proxiable           = (known after apply)
      + proxied             = true
      + settings            = (known after apply)
      + tags                = (known after apply)
      + tags_modified_on    = (known after apply)
      + ttl                 = 1
      + type                = "CNAME"
      + zone_id             = (known after apply)
    }

  # module.cloudflare.cloudflare_zone_setting.always_use_https will be created
  + resource "cloudflare_zone_setting" "always_use_https" {
      + editable       = (known after apply)
      + enabled        = (known after apply)
      + id             = (known after apply)
      + modified_on    = (known after apply)
      + setting_id     = "always_use_https"
      + time_remaining = (known after apply)
      + value          = "on"
      + zone_id        = (known after apply)
    }

  # module.cloudflare.cloudflare_zone_setting.http3 will be created
  + resource "cloudflare_zone_setting" "http3" {
      + editable       = (known after apply)
      + enabled        = (known after apply)
      + id             = (known after apply)
      + modified_on    = (known after apply)
      + setting_id     = "http3"
      + time_remaining = (known after apply)
      + value          = "on"
      + zone_id        = (known after apply)
    }

  # module.cloudflare.cloudflare_zone_setting.min_tls_version will be created
  + resource "cloudflare_zone_setting" "min_tls_version" {
      + editable       = (known after apply)
      + enabled        = (known after apply)
      + id             = (known after apply)
      + modified_on    = (known after apply)
      + setting_id     = "min_tls_version"
      + time_remaining = (known after apply)
      + value          = "1.2"
      + zone_id        = (known after apply)
    }

  # module.cloudflare.cloudflare_zone_setting.ssl will be created
  + resource "cloudflare_zone_setting" "ssl" {
      + editable       = (known after apply)
      + enabled        = (known after apply)
      + id             = (known after apply)
      + modified_on    = (known after apply)
      + setting_id     = "ssl"
      + time_remaining = (known after apply)
      + value          = "strict"
      + zone_id        = (known after apply)
    }

  # module.cloudflare.cloudflare_zone_setting.tls_1_3 will be created
  + resource "cloudflare_zone_setting" "tls_1_3" {
      + editable       = (known after apply)
      + enabled        = (known after apply)
      + id             = (known after apply)
      + modified_on    = (known after apply)
      + setting_id     = "tls_1_3"
      + time_remaining = (known after apply)
      + value          = "on"
      + zone_id        = (known after apply)
    }

  # module.gcp.google_app_engine_application.main will be created
  + resource "google_app_engine_application" "main" {
      + app_id            = (known after apply)
      + auth_domain       = (known after apply)
      + code_bucket       = (known after apply)
      + database_type     = "CLOUD_DATASTORE_COMPATIBILITY"
      + default_bucket    = (known after apply)
      + default_hostname  = (known after apply)
      + gcr_domain        = (known after apply)
      + id                = (known after apply)
      + location_id       = "asia-northeast1"
      + name              = (known after apply)
      + project           = "main-vcompute"
      + serving_status    = (known after apply)
      + ssl_policy        = (known after apply)
      + url_dispatch_rule = (known after apply)

      + feature_settings (known after apply)

      + iap (known after apply)
    }

  # module.gcp.google_app_engine_domain_mapping.main will be created
  + resource "google_app_engine_domain_mapping" "main" {
      + domain_name       = "tut-bus-api.hekuta.net"
      + id                = (known after apply)
      + name              = (known after apply)
      + override_strategy = "STRICT"
      + project           = "main-vcompute"
      + resource_records  = (known after apply)

      + ssl_settings {
          + certificate_id                 = (known after apply)
          + pending_managed_certificate_id = (known after apply)
          + ssl_management_type            = "AUTOMATIC"
        }
    }

  # module.gcp.google_compute_global_address.private_ip_address will be created
  + resource "google_compute_global_address" "private_ip_address" {
      + address            = (known after apply)
      + address_type       = "INTERNAL"
      + creation_timestamp = (known after apply)
      + effective_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
      + id                 = (known after apply)
      + label_fingerprint  = (known after apply)
      + name               = "tut-bus-private-ip-address"
      + network            = (known after apply)
      + prefix_length      = 16
      + project            = "main-vcompute"
      + purpose            = "VPC_PEERING"
      + self_link          = (known after apply)
      + terraform_labels   = {
          + "goog-terraform-provisioned" = "true"
        }
    }

  # module.gcp.google_compute_network.main will be created
  + resource "google_compute_network" "main" {
      + auto_create_subnetworks                   = false
      + bgp_always_compare_med                    = (known after apply)
      + bgp_best_path_selection_mode              = (known after apply)
      + bgp_inter_region_cost                     = (known after apply)
      + delete_bgp_always_compare_med             = false
      + delete_default_routes_on_create           = false
      + gateway_ipv4                              = (known after apply)
      + id                                        = (known after apply)
      + internal_ipv6_range                       = (known after apply)
      + mtu                                       = (known after apply)
      + name                                      = "tut-bus-network"
      + network_firewall_policy_enforcement_order = "AFTER_CLASSIC_FIREWALL"
      + network_id                                = (known after apply)
      + numeric_id                                = (known after apply)
      + project                                   = "main-vcompute"
      + routing_mode                              = (known after apply)
      + self_link                                 = (known after apply)
    }

  # module.gcp.google_compute_subnetwork.main will be created
  + resource "google_compute_subnetwork" "main" {
      + creation_timestamp         = (known after apply)
      + external_ipv6_prefix       = (known after apply)
      + fingerprint                = (known after apply)
      + gateway_address            = (known after apply)
      + id                         = (known after apply)
      + internal_ipv6_prefix       = (known after apply)
      + ip_cidr_range              = "10.0.0.0/24"
      + ipv6_cidr_range            = (known after apply)
      + ipv6_gce_endpoint          = (known after apply)
      + name                       = "tut-bus-subnet"
      + network                    = (known after apply)
      + private_ip_google_access   = (known after apply)
      + private_ipv6_google_access = (known after apply)
      + project                    = "main-vcompute"
      + purpose                    = (known after apply)
      + region                     = "asia-northeast1"
      + self_link                  = (known after apply)
      + stack_type                 = (known after apply)
      + state                      = (known after apply)
      + subnetwork_id              = (known after apply)

      + secondary_ip_range (known after apply)
    }

  # module.gcp.google_iam_workload_identity_pool.github will be created
  + resource "google_iam_workload_identity_pool" "github" {
      + description               = "Workload Identity Pool for TUT Bus GitHub Actions"
      + display_name              = "TUT Bus GitHub Actions Pool"
      + id                        = (known after apply)
      + name                      = (known after apply)
      + project                   = "main-vcompute"
      + state                     = (known after apply)
      + workload_identity_pool_id = "tut-bus-github-pool"
    }

  # module.gcp.google_iam_workload_identity_pool_provider.github will be created
  + resource "google_iam_workload_identity_pool_provider" "github" {
      + attribute_condition                = "assertion.repository_owner == 'lc-tut'"
      + attribute_mapping                  = {
          + "attribute.actor"            = "assertion.actor"
          + "attribute.repository"       = "assertion.repository"
          + "attribute.repository_owner" = "assertion.repository_owner"
          + "google.subject"             = "assertion.sub"
        }
      + description                        = "OIDC provider for TUT Bus GitHub Actions"
      + display_name                       = "TUT Bus GitHub Provider"
      + id                                 = (known after apply)
      + name                               = (known after apply)
      + project                            = "main-vcompute"
      + state                              = (known after apply)
      + workload_identity_pool_id          = "tut-bus-github-pool"
      + workload_identity_pool_provider_id = "tut-bus-github-provider"

      + oidc {
          + issuer_uri = "https://token.actions.githubusercontent.com"
        }
    }

  # module.gcp.google_project_iam_member.artifact_reader will be created
  + resource "google_project_iam_member" "artifact_reader" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/artifactregistry.reader"
    }

  # module.gcp.google_project_iam_member.logging_writer will be created
  + resource "google_project_iam_member" "logging_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/logging.logWriter"
    }

  # module.gcp.google_project_iam_member.monitoring_writer will be created
  + resource "google_project_iam_member" "monitoring_writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gcp.google_project_iam_member.sql_client will be created
  + resource "google_project_iam_member" "sql_client" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/cloudsql.client"
    }

  # module.gcp.google_project_iam_member.storage_viewer will be created
  + resource "google_project_iam_member" "storage_viewer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/storage.objectViewer"
    }

  # module.gcp.google_project_iam_member.terraform_appengine_admin will be created
  + resource "google_project_iam_member" "terraform_appengine_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/appengine.appAdmin"
    }

  # module.gcp.google_project_iam_member.terraform_artifact_admin will be created
  + resource "google_project_iam_member" "terraform_artifact_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/artifactregistry.admin"
    }

  # module.gcp.google_project_iam_member.terraform_iam_admin will be created
  + resource "google_project_iam_member" "terraform_iam_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/resourcemanager.projectIamAdmin"
    }

  # module.gcp.google_project_iam_member.terraform_network_admin will be created
  + resource "google_project_iam_member" "terraform_network_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/compute.networkAdmin"
    }

  # module.gcp.google_project_iam_member.terraform_sa_admin will be created
  + resource "google_project_iam_member" "terraform_sa_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/iam.serviceAccountAdmin"
    }

  # module.gcp.google_project_iam_member.terraform_sa_user will be created
  + resource "google_project_iam_member" "terraform_sa_user" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/iam.serviceAccountUser"
    }

  # module.gcp.google_project_iam_member.terraform_service_usage will be created
  + resource "google_project_iam_member" "terraform_service_usage" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/serviceusage.serviceUsageAdmin"
    }

  # module.gcp.google_project_iam_member.terraform_sql_admin will be created
  + resource "google_project_iam_member" "terraform_sql_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/cloudsql.admin"
    }

  # module.gcp.google_project_iam_member.terraform_storage_admin will be created
  + resource "google_project_iam_member" "terraform_storage_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/storage.admin"
    }

  # module.gcp.google_project_iam_member.terraform_wip_admin will be created
  + resource "google_project_iam_member" "terraform_wip_admin" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + project = "main-vcompute"
      + role    = "roles/iam.workloadIdentityPoolAdmin"
    }

  # module.gcp.google_project_service.artifactregistry will be created
  + resource "google_project_service" "artifactregistry" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "artifactregistry.googleapis.com"
    }

  # module.gcp.google_project_service.cloudresourcemanager will be created
  + resource "google_project_service" "cloudresourcemanager" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "cloudresourcemanager.googleapis.com"
    }

  # module.gcp.google_project_service.compute will be created
  + resource "google_project_service" "compute" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "compute.googleapis.com"
    }

  # module.gcp.google_project_service.iam will be created
  + resource "google_project_service" "iam" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "iam.googleapis.com"
    }

  # module.gcp.google_project_service.iamcredentials will be created
  + resource "google_project_service" "iamcredentials" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "iamcredentials.googleapis.com"
    }

  # module.gcp.google_project_service.logging will be created
  + resource "google_project_service" "logging" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "logging.googleapis.com"
    }

  # module.gcp.google_project_service.monitoring will be created
  + resource "google_project_service" "monitoring" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "monitoring.googleapis.com"
    }

  # module.gcp.google_project_service.servicenetworking will be created
  + resource "google_project_service" "servicenetworking" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "servicenetworking.googleapis.com"
    }

  # module.gcp.google_project_service.sqladmin will be created
  + resource "google_project_service" "sqladmin" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "sqladmin.googleapis.com"
    }

  # module.gcp.google_project_service.storage will be created
  + resource "google_project_service" "storage" {
      + disable_on_destroy = false
      + id                 = (known after apply)
      + project            = "main-vcompute"
      + service            = "storage.googleapis.com"
    }

  # module.gcp.google_service_account.main will be created
  + resource "google_service_account" "main" {
      + account_id   = "tut-bus-app-sa"
      + disabled     = false
      + display_name = "TUT Bus Application Service Account"
      + email        = "tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "main-vcompute"
      + unique_id    = (known after apply)
    }

  # module.gcp.google_service_account.terraform will be created
  + resource "google_service_account" "terraform" {
      + account_id   = "tut-bus-terraform-sa"
      + description  = "Service account for TUT Bus Terraform operations via GitHub Actions"
      + disabled     = false
      + display_name = "TUT Bus Terraform Service Account"
      + email        = "tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + id           = (known after apply)
      + member       = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + name         = (known after apply)
      + project      = "main-vcompute"
      + unique_id    = (known after apply)
    }

  # module.gcp.google_service_account_iam_member.workload_identity_user will be created
  + resource "google_service_account_iam_member" "workload_identity_user" {
      + etag               = (known after apply)
      + id                 = (known after apply)
      + member             = (known after apply)
      + role               = "roles/iam.workloadIdentityUser"
      + service_account_id = (known after apply)
    }

  # module.gcp.google_service_networking_connection.private_vpc_connection will be created
  + resource "google_service_networking_connection" "private_vpc_connection" {
      + id                      = (known after apply)
      + network                 = (known after apply)
      + peering                 = (known after apply)
      + reserved_peering_ranges = [
          + "tut-bus-private-ip-address",
        ]
      + service                 = "servicenetworking.googleapis.com"
    }

  # module.gcp.google_sql_database.main will be created
  + resource "google_sql_database" "main" {
      + charset         = (known after apply)
      + collation       = (known after apply)
      + deletion_policy = "DELETE"
      + id              = (known after apply)
      + instance        = "tut-bus-db-prod"
      + name            = "tutbus"
      + project         = "main-vcompute"
      + self_link       = (known after apply)
    }

  # module.gcp.google_sql_database_instance.main will be created
  + resource "google_sql_database_instance" "main" {
      + available_maintenance_versions = (known after apply)
      + connection_name                = (known after apply)
      + database_version               = "POSTGRES_15"
      + deletion_protection            = false
      + dns_name                       = (known after apply)
      + dns_names                      = (known after apply)
      + encryption_key_name            = (known after apply)
      + first_ip_address               = (known after apply)
      + id                             = (known after apply)
      + instance_type                  = (known after apply)
      + ip_address                     = (known after apply)
      + maintenance_version            = (known after apply)
      + master_instance_name           = (known after apply)
      + name                           = "tut-bus-db-prod"
      + node_count                     = (known after apply)
      + private_ip_address             = (known after apply)
      + project                        = "main-vcompute"
      + psc_service_attachment_link    = (known after apply)
      + public_ip_address              = (known after apply)
      + region                         = "asia-northeast1"
      + replica_names                  = (known after apply)
      + root_password_wo               = (write-only attribute)
      + self_link                      = (known after apply)
      + server_ca_cert                 = (sensitive value)
      + service_account_email_address  = (known after apply)

      + replica_configuration (known after apply)

      + replication_cluster (known after apply)

      + settings {
          + activation_policy           = "ALWAYS"
          + availability_type           = "ZONAL"
          + connector_enforcement       = (known after apply)
          + disk_autoresize             = false
          + disk_autoresize_limit       = 0
          + disk_size                   = 10
          + disk_type                   = (known after apply)
          + edition                     = (known after apply)
          + effective_availability_type = (known after apply)
          + pricing_plan                = "PER_USE"
          + tier                        = "db-f1-micro"
          + user_labels                 = (known after apply)
          + version                     = (known after apply)

          + backup_configuration {
              + backup_tier                    = (known after apply)
              + enabled                        = true
              + point_in_time_recovery_enabled = false
              + start_time                     = "03:00"
              + transaction_log_retention_days = 1

              + backup_retention_settings (known after apply)
            }

          + connection_pool_config (known after apply)

          + data_cache_config (known after apply)

          + insights_config (known after apply)

          + ip_configuration {
              + enable_private_path_for_google_cloud_services = true
              + ipv4_enabled                                  = false
              + private_network                               = (known after apply)
              + server_ca_mode                                = (known after apply)
              + ssl_mode                                      = (known after apply)
            }

          + location_preference (known after apply)

          + maintenance_window {
              + day  = 7
              + hour = 4
            }

          + read_pool_auto_scale_config (known after apply)
        }
    }

  # module.gcp.google_sql_user.iam_user will be created
  + resource "google_sql_user" "iam_user" {
      + host                    = (known after apply)
      + iam_email               = (known after apply)
      + id                      = (known after apply)
      + instance                = "tut-bus-db-prod"
      + name                    = "tut-bus-app-sa@main-vcompute.iam"
      + password_wo             = (write-only attribute)
      + project                 = "main-vcompute"
      + sql_server_user_details = (known after apply)
      + type                    = "CLOUD_IAM_SERVICE_ACCOUNT"
    }

  # module.gcp.google_storage_bucket.terraform_state will be created
  + resource "google_storage_bucket" "terraform_state" {
      + effective_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "purpose"                    = "terraform-state"
        }
      + force_destroy               = false
      + id                          = (known after apply)
      + labels                      = {
          + "environment" = "production"
          + "managed-by"  = "terraform"
          + "purpose"     = "terraform-state"
        }
      + location                    = "ASIA-NORTHEAST1"
      + name                        = "tut-bus-terraform-state"
      + project                     = "main-vcompute"
      + project_number              = (known after apply)
      + public_access_prevention    = "enforced"
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "environment"                = "production"
          + "goog-terraform-provisioned" = "true"
          + "managed-by"                 = "terraform"
          + "purpose"                    = "terraform-state"
        }
      + time_created                = (known after apply)
      + uniform_bucket_level_access = true
      + updated                     = (known after apply)
      + url                         = (known after apply)

      + lifecycle_rule {
          + action {
              + type          = "Delete"
                # (1 unchanged attribute hidden)
            }
          + condition {
              + matches_prefix         = []
              + matches_storage_class  = []
              + matches_suffix         = []
              + num_newer_versions     = 5
              + with_state             = "ARCHIVED"
                # (3 unchanged attributes hidden)
            }
        }

      + soft_delete_policy (known after apply)

      + versioning {
          + enabled = true
        }

      + website (known after apply)
    }

  # module.gcp.google_storage_bucket_iam_member.terraform_state_admin will be created
  + resource "google_storage_bucket_iam_member" "terraform_state_admin" {
      + bucket = "tut-bus-terraform-state"
      + etag   = (known after apply)
      + id     = (known after apply)
      + member = "serviceAccount:tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
      + role   = "roles/storage.objectAdmin"
    }

  # module.vercel.vercel_project.main will be created
  + resource "vercel_project" "main" {
      + auto_assign_custom_domains                        = true
      + automatically_expose_system_environment_variables = (known after apply)
      + build_command                                     = "pnpm run build"
      + build_machine_type                                = "enhanced"
      + customer_success_code_visibility                  = (known after apply)
      + directory_listing                                 = (known after apply)
      + enable_affected_projects_deployments              = (known after apply)
      + enable_preview_feedback                           = (known after apply)
      + enable_production_feedback                        = (known after apply)
      + framework                                         = "nextjs"
      + function_failover                                 = (known after apply)
      + git_fork_protection                               = true
      + git_lfs                                           = (known after apply)
      + git_provider_options                              = (known after apply)
      + git_repository                                    = {
          + production_branch = "main"
          + repo              = "lc-tut/tut-bus"
          + type              = "github"
        }
      + id                                                = (known after apply)
      + install_command                                   = "pnpm install"
      + name                                              = "tut-bus-web"
      + node_version                                      = (known after apply)
      + oidc_token_config                                 = {
          + issuer_mode = "team"
        }
      + on_demand_concurrent_builds                       = (known after apply)
      + output_directory                                  = ".next"
      + preview_comments                                  = (known after apply)
      + preview_deployments_disabled                      = (known after apply)
      + prioritise_production_builds                      = (known after apply)
      + protection_bypass_for_automation_secret           = (sensitive value)
      + resource_config                                   = (known after apply)
      + root_directory                                    = "apps/web"
      + serverless_function_region                        = (known after apply)
      + team_id                                           = (known after apply)
      + vercel_authentication                             = (known after apply)
    }

  # module.vercel.vercel_project_deployment_retention.main[0] will be created
  + resource "vercel_project_deployment_retention" "main" {
      + expiration_canceled   = "1m"
      + expiration_errored    = "2m"
      + expiration_preview    = "3m"
      + expiration_production = "1y"
      + id                    = (known after apply)
      + project_id            = (known after apply)
      + team_id               = "team_kIKSNppKX4A6hEGHw7pLgbPV"
    }

  # module.vercel.vercel_project_domain.custom_domain[0] will be created
  + resource "vercel_project_domain" "custom_domain" {
      + domain     = "tut-bus.lcn.ad.jp"
      + id         = (known after apply)
      + project_id = (known after apply)
      + team_id    = (known after apply)
    }

  # module.vercel.vercel_project_domain.redirect_domains["tut-bus.hekuta.net"] will be created
  + resource "vercel_project_domain" "redirect_domains" {
      + domain               = "tut-bus.hekuta.net"
      + id                   = (known after apply)
      + project_id           = (known after apply)
      + redirect             = "tut-bus.lcn.ad.jp"
      + redirect_status_code = 308
      + team_id              = (known after apply)
    }

  # module.vercel.vercel_project_domain.vercel_app_redirect[0] will be created
  + resource "vercel_project_domain" "vercel_app_redirect" {
      + domain               = "tut-bus-web.vercel.app"
      + id                   = (known after apply)
      + project_id           = (known after apply)
      + redirect             = "tut-bus.lcn.ad.jp"
      + redirect_status_code = 308
      + team_id              = (known after apply)
    }

  # module.vercel.vercel_project_environment_variable.announcement_link_text[0] will be created
  + resource "vercel_project_environment_variable" "announcement_link_text" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_ANNOUNCEMENT_LINK_TEXT"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.announcement_link_url[0] will be created
  + resource "vercel_project_environment_variable" "announcement_link_url" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_ANNOUNCEMENT_LINK_URL"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.announcement_message[0] will be created
  + resource "vercel_project_environment_variable" "announcement_message" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_ANNOUNCEMENT_MESSAGE"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.announcement_title[0] will be created
  + resource "vercel_project_environment_variable" "announcement_title" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_ANNOUNCEMENT_TITLE"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.announcement_type[0] will be created
  + resource "vercel_project_environment_variable" "announcement_type" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_ANNOUNCEMENT_TYPE"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.api_url_development will be created
  + resource "vercel_project_environment_variable" "api_url_development" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_API_URL"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "development",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.api_url_preview will be created
  + resource "vercel_project_environment_variable" "api_url_preview" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_API_URL"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.api_url_production will be created
  + resource "vercel_project_environment_variable" "api_url_production" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_API_URL"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.app_url_production will be created
  + resource "vercel_project_environment_variable" "app_url_production" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_APP_URL"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.auth_allowed_team[0] will be created
  + resource "vercel_project_environment_variable" "auth_allowed_team" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "AUTH_ALLOWED_TEAM"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.auth_github_id will be created
  + resource "vercel_project_environment_variable" "auth_github_id" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "AUTH_GITHUB_ID"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.auth_github_secret will be created
  + resource "vercel_project_environment_variable" "auth_github_secret" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "AUTH_GITHUB_SECRET"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.better_auth_secret will be created
  + resource "vercel_project_environment_variable" "better_auth_secret" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "BETTER_AUTH_SECRET"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.enable_corepack will be created
  + resource "vercel_project_environment_variable" "enable_corepack" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "ENABLE_EXPERIMENTAL_COREPACK"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "development",
          + "preview",
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

  # module.vercel.vercel_project_environment_variable.ga_id[0] will be created
  + resource "vercel_project_environment_variable" "ga_id" {
      + comment                = (known after apply)
      + custom_environment_ids = (known after apply)
      + id                     = (known after apply)
      + key                    = "NEXT_PUBLIC_GA_ID"
      + project_id             = (known after apply)
      + sensitive              = (known after apply)
      + target                 = [
          + "production",
        ]
      + team_id                = (known after apply)
      + value                  = (sensitive value)
    }

Plan: 67 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + cloudflare_api_hostname                   = "tut-bus-api.hekuta.net"
  + cloudflare_api_ip                         = "ghs.googlehosted.com"
  + cloudflare_api_record_id                  = (known after apply)
  + cloudflare_zone_id                        = (known after apply)
  + cloudflare_zone_name                      = (known after apply)
  + deployment_summary                        = {
      + api_url     = "https://tut-bus-api.hekuta.net"
      + environment = "production"
      + project_id  = "main-vcompute"
      + region      = "asia-northeast1"
      + web_url     = "https://tut-bus.lcn.ad.jp"
    }
  + gcp_db_connection_name                    = (known after apply)
  + gcp_db_instance_name                      = "tut-bus-db-prod"
  + gcp_db_public_ip                          = (known after apply)
  + gcp_network_name                          = "tut-bus-network"
  + gcp_service_account_email                 = "tut-bus-app-sa@main-vcompute.iam.gserviceaccount.com"
  + gcp_subnet_name                           = "tut-bus-subnet"
  + github_actions_terraform_sa               = "tut-bus-terraform-sa@main-vcompute.iam.gserviceaccount.com"
  + github_actions_workload_identity_provider = (known after apply)
  + terraform_state_bucket                    = "tut-bus-terraform-state"
  + vercel_custom_domain                      = "tut-bus.lcn.ad.jp"
  + vercel_project_framework                  = "nextjs"
  + vercel_project_id                         = (known after apply)
  + vercel_project_name                       = "tut-bus-web"

Warning: Resource Destruction Considerations

  with module.cloudflare.cloudflare_zone_setting.ssl,
  on modules/cloudflare/main.tf line 21, in resource "cloudflare_zone_setting" "ssl":
  21: resource "cloudflare_zone_setting" "ssl" {

This resource cannot be destroyed from Terraform. If you create this
resource, it will be present in the API until manually deleted.

(and 4 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @HEKUCHAN, Branch: `develop/make-github-actions`*